console.log(`Привет!
Если посчитаешь, что что-то не соответсвует требованиям, пожалуйста, сообще мне и я сразу исправлю.
Поясню сразу насчет футера - там всё в соответствии с требованиями и макетом. По макету между годом, названием школы и именем одинаковое расстояние, название школы уже не центрируется в макете, как раньше при 1440 пикс. У меня сделано именно так как в макете - между флексовыми элеменами задано одинаковое расстояние при уменьшении экрана.

Самопроверка:
Вёрстка соответствует макету. Ширина экрана 768px.
Ни на одном из разрешений до 640px включительно не появляется горизонтальная полоса прокрутки.
Весь контент страницы при этом сохраняется: не обрезается и не удаляется.
На ширине экрана 768рх реализовано адаптивное меню.`);
